/*11. Створити файл iз списком товарів у магазині: 
найменування, дата випуску, кінцевий термін придатності, 
ціна. Знизити ціну на 5% на всі товари, максимальний 
термін зберігання яких не перевищує двох тижнів. 
Підвищити ціну на 3% на товари, максимальний термін 
зберігання яких більш одного року. Максимальний 
термін зберігання розрахувати як різницю кінцевого 
терміну придатності та дати випуску товару. 
Скопіювати в новий файл дані про товари, вироблені 
раніше поточного місяця.*/
#include "lib.h"
int main() {
	string file, newfile;
	cout << "enter the filename: "; cin >> file; cout << endl;
	fileInput(file);
	fileOutput(file);
	cout << "enter the name for a new file: "; cin >> newfile; cout << endl;
	copyFile(file, newfile);
	fileOutput(newfile);
	return 0;
}